In [1]:
import pandas as pd
import numpy as np

In [4]:
my_data=np.array([[10,20,30],[20,30,40],[20,50,10],[10,15,20]])

In [5]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [12]:
my_names=["James","Lars","Kirk","Rob"]

In [13]:
my_columns=["Jan","Feb","Mar"]

In [14]:
my_data_frame=pd.DataFrame(my_data)

In [15]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [16]:
new_data_frame=pd.DataFrame(my_data,index=my_names,columns=my_columns)

In [17]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [18]:
new_data_frame["Feb"]

James    20
Lars     30
Kirk     50
Rob      15
Name: Feb, dtype: int32

In [21]:
feb_series=new_data_frame["Feb"]

In [22]:
feb_series.mean()

28.75

In [23]:
feb_series.Lars

30

In [25]:
feb_series.max()

50

In [28]:
new_data_frame[["Jan","Feb"]]

       Jan  Feb
James   10   20
Lars    20   30
Kirk    20   50
Rob     10   15

In [29]:
new_data_frame.loc["Lars"]

Jan    20
Feb    30
Mar    40
Name: Lars, dtype: int32

In [31]:
new_data_frame.loc["Rob"].mean()

15.0

In [32]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [33]:
new_data_frame.loc["James"].max()

30

In [34]:
new_data_frame.loc["Kirk"].mean()

26.666666666666668

In [37]:
new_data_frame.iloc[0]

Jan    10
Feb    20
Mar    30
Name: James, dtype: int32

In [47]:
new_data_frame["April"]=new_data_frame["Mar"]*2

In [49]:
new_data_frame

       Jan  Feb  Mar  April
James   10   20   30     60
Lars    20   30   40     80
Kirk    20   50   10     20
Rob     10   15   20     40

In [50]:
new_data_frame.drop("Rob",axis=0)

       Jan  Feb  Mar  April
James   10   20   30     60
Lars    20   30   40     80
Kirk    20   50   10     20

In [51]:
new_data_frame.drop("Feb",axis=1)

       Jan  Mar  April
James   10   30     60
Lars    20   40     80
Kirk    20   10     20
Rob     10   20     40

In [52]:
new_data_frame

       Jan  Feb  Mar  April
James   10   20   30     60
Lars    20   30   40     80
Kirk    20   50   10     20
Rob     10   15   20     40

In [53]:
new_data_frame.drop("April",axis=1,inplace=True)

In [54]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [55]:
boolean_frame=new_data_frame>25

In [56]:
boolean_frame

         Jan    Feb    Mar
James  False  False   True
Lars   False   True   True
Kirk   False   True  False
Rob    False  False  False

In [59]:
new_data_frame[boolean_frame]

       Jan   Feb   Mar
James  NaN   NaN  30.0
Lars   NaN  30.0  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [60]:
new_data_frame[new_data_frame>30]

       Jan   Feb   Mar
James  NaN   NaN   NaN
Lars   NaN   NaN  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [61]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [62]:
new_data_frame["Yeni Kolon"]=["Ege","Demet","Buket","Özlem"]

In [63]:
new_data_frame

       Jan  Feb  Mar Yeni Kolon
James   10   20   30        Ege
Lars    20   30   40      Demet
Kirk    20   50   10      Buket
Rob     10   15   20      Özlem

In [65]:
new_data_frame["Özel"]=["Vans","Coloumbia","Converse","Puma"]

In [66]:
new_data_frame

       Jan  Feb  Mar Yeni Kolon       Özel
James   10   20   30        Ege       Vans
Lars    20   30   40      Demet  Coloumbia
Kirk    20   50   10      Buket   Converse
Rob     10   15   20      Özlem       Puma

In [71]:
new_data_frame.drop("Özel",axis=1,inplace=True)

In [72]:
new_data_frame

       Jan  Feb  Mar Yeni Kolon
James   10   20   30        Ege
Lars    20   30   40      Demet
Kirk    20   50   10      Buket
Rob     10   15   20      Özlem

In [73]:
new_data_frame.drop("Yeni Kolon",axis=1,inplace=True)

In [74]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [75]:
my_dict={"James":[40,30,np.nan],"Kirk":[20,np.nan,50],"Lars":[30,50,40]}

In [76]:
my_dict

{'James': [40, 30, nan], 'Kirk': [20, nan, 50], 'Lars': [30, 50, 40]}

In [77]:
my_data_frame=pd.DataFrame(my_dict)

In [78]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [79]:
my_data_frame.dropna()

   James  Kirk  Lars
0   40.0  20.0    30

In [80]:
my_data_frame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [81]:
my_data_frame.dropna(axis=1)

   Lars
0    30
1    50
2    40

In [82]:
my_new_dict={"James":[40,30,np.nan],"Kirk":[20,np.nan,50],"Lars":[30,50,40],"Rob":[45,np.nan,np.nan]}

In [83]:
my_new_dict

{'James': [40, 30, nan],
 'Kirk': [20, nan, 50],
 'Lars': [30, 50, 40],
 'Rob': [45, nan, nan]}

In [84]:
yeni_data=pd.DataFrame(my_new_dict)

In [85]:
yeni_data

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [96]:
yeni_data.dropna(axis=1,thresh=2)

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [101]:
yeni_data.fillna("!!!")

  James  Kirk  Lars   Rob
0  40.0  20.0    30  45.0
1  30.0   !!!    50   !!!
2   !!!  50.0    40   !!!

In [130]:
salary_dict={"Programming Language":["Python","Python","Python","Java","Java","Swift"],"Name":["A","B","C","D","E","F"],"Salary":[100,90,80,70,60,50]}

In [131]:
salary_frame=pd.DataFrame(salary_dict)

In [132]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [133]:
group_object=salary_frame.groupby("Programming Language")

In [134]:
group_object.count()

                      Name  Salary
Programming Language
Java                     2       2
Python                   3       3
Swift                    1       1

In [136]:
group_object.min()

                     Name  Salary
Programming Language
Java                    D      60
Python                  A      80
Swift                   F      50

In [138]:
group_object.mean("Salary")

                      Salary
Programming Language
Java                    65.0
Python                  90.0
Swift                   50.0

In [139]:
group_object.max()

                     Name  Salary
Programming Language
Java                    E      70
Python                  C     100
Swift                   F      50

In [140]:
group_object.min()

                     Name  Salary
Programming Language
Java                    D      60
Python                  A      80
Swift                   F      50

In [141]:
group_object

In [142]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [143]:
group_object.min("Salary")

                      Salary
Programming Language
Java                      60
Python                    80
Swift                     50

In [144]:
group_object.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [145]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [146]:
salary_frame.describe()

           Salary
count    6.000000
mean    75.000000
std     18.708287
min     50.000000
25%     62.500000
50%     75.000000
75%     87.500000
max    100.000000

In [156]:
sozluk_son={"Name":["A","B","C","D"],
           "Sports":["Basketball","Football","Tennis",
            "Runnin"],"Calories":[100,200,300,400]}

In [157]:
sozluk_son

{'Name': ['A', 'B', 'C', 'D'],
 'Sports': ['Basketball', 'Football', 'Tennis', 'Runnin'],
 'Calories': [100, 200, 300, 400]}

In [170]:
cerceve1=pd.DataFrame(sozluk_son)

In [171]:
cerceve1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D      Runnin       400

In [172]:
sozluk2_son={"Name":["E","F","G","H"],
           "Sports":["Basketball","Football","Tennis",
            "Runnin"],"Calories":[200,50,330,440]}

In [173]:
cerceve2=pd.DataFrame(sozluk2_son,index=[4,5,6,7])

In [174]:
cerceve2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H      Runnin       440

In [175]:
sozluk3_son={"Name":["I","J","K","L"],
           "Sports":["Basketball","Football","Tennis",
            "Runnin"],"Calories":[300,150,320,410]}

In [176]:
cerceve3=pd.DataFrame(sozluk3_son,index=[8,9,10,11])

In [177]:
cerceve3

   Name      Sports  Calories
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L      Runnin       410

In [178]:
pd.concat([cerceve1,cerceve2,cerceve3])

   Name      Sports  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D      Runnin       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       330
7     H      Runnin       440
8     I  Basketball       300
9     J    Football       150
10    K      Tennis       320
11    L      Runnin       410

In [179]:
cerceve1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D      Runnin       400

In [180]:
cerceve2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       330
7    H      Runnin       440

In [181]:
pd.merge(cerceve1,cerceve2,on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         330
3      D      Runnin         400      H         440

In [182]:
yeni_maas=pd.DataFrame({"Name":["James","Kirk","Lars"]
                       ,"Salary":[10,20,30],"Age":[60,65
                                                  ,70]})

In [195]:
yeni_maas

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [196]:
def grossToNet(salary):
    return salary*0.65

In [197]:
yeni_maas["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64

In [198]:
def doubleAge(age):
    return age*2

In [199]:
yeni_maas["Age"].apply(doubleAge)

0    120
1    130
2    140
Name: Age, dtype: int64